posts/20200511/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="The quantum program for EuroCrypt 2020 virtual conference is starting may 12th. Most talks are available on youtube.  ">
<meta name="viewport" content="width=device-width">
<title>EuroCrypt 2020: Quantum program | Qoherences</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://h-oll.github.io/qoherences/posts/20200511/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Harold Ollivier">
<meta property="og:site_name" content="Qoherences">
<meta property="og:title" content="EuroCrypt 2020: Quantum program">
<meta property="og:url" content="https://h-oll.github.io/qoherences/posts/20200511/">
<meta property="og:description" content="The quantum program for EuroCrypt 2020 virtual conference is starting may 12th. Most talks are available on youtube.  ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-05-11T07:03:01+02:00">
</head>
<body>
    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://h-oll.github.io/qoherences/" title="Qoherences" rel="home">
                Qoherences
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                EuroCrypt 2020: Quantum program
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2020-05-11T07:03:01+02:00">2020/05/11</time>
	    

	    
          |  
        <a href="index.org" id="sourcelink">Source</a>

	  </div>
	  <div class="post-tags">
	  </div>
	</div>
      </div>
    </div>


    <div id="post-main" class="main">
        <div class="container">
        <p>
EuroCrypt 2020 going virtual, mst talks are available from the website of conference (sending back to IACR <a href="https://www.youtube.com/channel/UCV-WittrGkRyONzX6UmCaiA">youtube channel</a>).
</p>

<div id="outline-container-org3e398e6" class="outline-2">
<h2 id="org3e398e6">Quantum Cryptography</h2>
<div class="outline-text-2" id="text-org3e398e6">
<p>
Moderators: Zvika Brakerski, Anne Broadbent, and Adam Smith
</p>

<ul class="org-ul">
<li>Measure-Rewind-Measure: Tighter Quantum Random Oracle Model Proofs for One-Way to Hiding and CCA Security (<i>Veronika Kuchta Amin Sakzad Damien Stehlé Ron Steinfeld Shi-Feng Sun</i>)</li>
<li>Secure Multi-party Quantum Computation with a Dishonest Majority (<i>Yfke Dulek Stacey Jeffery Alex B. Grilo Christian Majenz Christian Schaffner</i>)</li>
<li>Efficient Simulation of Random States and Random Unitaries (<i>Gorjan Alagic Christian Majenz Alexander Russell</i>)</li>
<li>Quantum-Access-Secure Message Authentication via Blind-Unforgeability (<i>Gorjan Alagic Christian Majenz Alexander Russell Fang Song</i>)</li>
</ul>
</div>
</div>


<div id="outline-container-orgc823d63" class="outline-2">
<h2 id="orgc823d63">Quantum Cryptanalysis</h2>
<div class="outline-text-2" id="text-orgc823d63">
<p>
Moderators: Jian Guo, Gregor Leander, Bart Mennik, and Gilles Van Assche
</p>

<ul class="org-ul">
<li>Finding Hash Collisions with Quantum Computers by Using Differential Trails with Smaller Probability than Birthday Bound (<i>Akinori Hosoyamada Yu Sasaki</i>)</li>
<li>Implementing Grover oracles for quantum key search on AES and LowMC (<i>Samuel Jaques Michael Naehrig Martin Roetteler Fernando Virdia</i>)</li>
<li>Optimal Merging in Quantum $k$-xor and $k$-sum Algorithms (<i>María Naya-Plasencia André Schrottenloher</i>)</li>
<li>On the Quantum Complexity of the Continuous Hidden Subgroup Problem (<i>Koen de Boer Léo Ducas Serge Fehr</i>)</li>
</ul>
</div>
</div>
            
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="qoherences",
            disqus_url="https://h-oll.github.io/qoherences/posts/20200511/",
        disqus_title="EuroCrypt 2020: Quantum program",
        disqus_identifier="cache/posts/20200511.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        

        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">



                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2021         <a href="mailto:harold.ollivier@linksights.io">Harold Ollivier</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><!-- Global site tag (gtag.js) - Google Analytics --><script async src="https://www.googletagmanager.com/gtag/js?id=G-BGX6FC0Q0M"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'G-BGX6FC0Q0M');
</script><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
